<?php
/**
 * Created by PhpStorm.
 * User: yihuaiyuan
 * Date: 2018/9/13
 * Time: 下午5:18
 * 广度优先搜索
 * 图,
 * 用->表示转发好友， 共有成员w1到w20
 * w1-> w2,w3,w4
 * w2-> w5,w6
 * w3-> w4,w5,w7
 * w4->
 * w5-> w1,w7,w8,w14
 * w6-> w4,w9
 * w7-> w1,w2,w10
 * w8-> w9
 * w9-> w11,w12,w13,w14
 * w10->w4,w13,w15
 * w11->
 * w12->
 * w13->w16
 * w14->w17,w18
 * w15->
 * w16->w8,w11,w19
 * w17->
 * w18->
 * w19->w20
 * w20->
 */

$data = [];
$data['w1'] = ['w2', 'w3', 'w4'];
$data['w2'] = ['w5', 'w6'];
$data['w3'] = ['w4', 'w5', 'w7'];
$data['w4'] = [];
$data['w5'] = ['w1', 'w7', 'w8', 'w14'];
$data['w6'] = ['w4','w9'];
$data['w7'] = ['w1','w2','w10'];
$data['w8'] = ['w9'];
$data['w9'] = ['w11','w12','w13','w14'];

$data['w10'] = ['w4','w13','w15'];
$data['w11'] = [];
$data['w12'] = [];
$data['w13'] = ['w16'];
$data['w14'] = ['w17','w18'];
$data['w15'] = [];
$data['w16'] = ['w8','w11','w19'];
$data['w17'] = [];
$data['w18'] = [];
$data['w19'] = ['w20'];
$data['w20'] = [];





